{
    "config": {
        "layers": [
            {
                "name": "input_1",
                "config": {
                    "name": "input_1",
                    "input_dtype": "float32",
                    "batch_input_shape": [
                        null,
                        784
                    ],
                    "sparse": false
                },
                "class_name": "InputLayer",
                "inbound_nodes": []
            },
            {
                "name": "dense_1",
                "config": {
                    "b_regularizer": null,
                    "trainable": true,
                    "bias": true,
                    "activation": "relu",
                    "output_dim": 64,
                    "init": "glorot_uniform",
                    "W_constraint": null,
                    "W_regularizer": null,
                    "activity_regularizer": null,
                    "name": "dense_1",
                    "b_constraint": null,
                    "input_dim": null
                },
                "class_name": "Dense",
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0
                        ]
                    ]
                ]
            },
            {
                "name": "dense_2",
                "config": {
                    "b_regularizer": null,
                    "trainable": true,
                    "bias": true,
                    "activation": "relu",
                    "output_dim": 64,
                    "init": "glorot_uniform",
                    "W_constraint": null,
                    "W_regularizer": null,
                    "activity_regularizer": null,
                    "name": "dense_2",
                    "b_constraint": null,
                    "input_dim": null
                },
                "class_name": "Dense",
                "inbound_nodes": [
                    [
                        [
                            "dense_1",
                            0,
                            0
                        ]
                    ]
                ]
            },
            {
                "name": "dense_3",
                "config": {
                    "b_regularizer": null,
                    "trainable": true,
                    "bias": true,
                    "activation": "softmax",
                    "output_dim": 10,
                    "init": "glorot_uniform",
                    "W_constraint": null,
                    "W_regularizer": null,
                    "activity_regularizer": null,
                    "name": "dense_3",
                    "b_constraint": null,
                    "input_dim": null
                },
                "class_name": "Dense",
                "inbound_nodes": [
                    [
                        [
                            "dense_2",
                            0,
                            0
                        ]
                    ]
                ]
            }
        ],
        "name": "model_1",
        "input_layers": [
            [
                "input_1",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "dense_3",
                0,
                0
            ]
        ]
    },
    "class_name": "Model",
    "keras_version": "1.1.0"
}
