{"class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"sparse": false, "input_dtype": "int32", "name": "input_2", "batch_input_shape": [null, 100]}}, {"inbound_nodes": [[["input_2", 0, 0]]], "class_name": "Embedding", "name": "embedding_1", "config": {"trainable": true, "output_dim": 256, "mask_zero": false, "init": "uniform", "W_regularizer": null, "dropout": 0.0, "input_length": 100, "input_dtype": "int32", "input_dim": 10000, "activity_regularizer": null, "batch_input_shape": [null, 100], "name": "embedding_1", "W_constraint": null}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "input_dtype": "float32", "name": "input_1", "batch_input_shape": [null, 224, 224, 3]}}, {"inbound_nodes": [[["embedding_1", 0, 0]]], "class_name": "LSTM", "name": "lstm_1", "config": {"go_backwards": false, "trainable": true, "consume_less": "cpu", "inner_init": "orthogonal", "forget_bias_init": "one", "return_sequences": false, "b_regularizer": null, "init": "glorot_uniform", "dropout_U": 0.0, "stateful": false, "unroll": false, "input_length": null, "activation": "tanh", "U_regularizer": null, "input_dim": 256, "output_dim": 256, "dropout_W": 0.0, "inner_activation": "hard_sigmoid", "name": "lstm_1", "W_regularizer": null}}, {"inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Sequential", "name": "sequential_1", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "subsample": [1, 1], "b_regularizer": null, "batch_input_shape": [null, 224, 224, 3], "nb_row": 3, "W_regularizer": null, "W_constraint": null, "bias": true, "nb_col": 3, "nb_filter": 64, "input_dtype": "float32", "init": "glorot_uniform", "border_mode": "same", "name": "convolution2d_1", "activity_regularizer": null, "dim_ordering": "tf", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "W_constraint": null, "bias": true, "nb_col": 3, "nb_filter": 64, "name": "convolution2d_2", "init": "glorot_uniform", "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "W_constraint": null, "bias": true, "nb_col": 3, "nb_filter": 128, "name": "convolution2d_3", "init": "glorot_uniform", "border_mode": "same", "activity_regularizer": null, "dim_ordering": "tf", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "W_constraint": null, "bias": true, "nb_col": 3, "nb_filter": 128, "name": "convolution2d_4", "init": "glorot_uniform", "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "W_constraint": null, "bias": true, "nb_col": 3, "nb_filter": 256, "name": "convolution2d_5", "init": "glorot_uniform", "border_mode": "same", "activity_regularizer": null, "dim_ordering": "tf", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "W_constraint": null, "bias": true, "nb_col": 3, "nb_filter": 256, "name": "convolution2d_6", "init": "glorot_uniform", "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "W_constraint": null, "bias": true, "nb_col": 3, "nb_filter": 256, "name": "convolution2d_7", "init": "glorot_uniform", "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}]}, {"inbound_nodes": [[["lstm_1", 0, 0], ["sequential_1", 1, 0]]], "class_name": "Merge", "name": "merge_1", "config": {"mode": "concat", "concat_axis": -1, "output_shape": null, "dot_axes": -1, "mode_type": "raw", "name": "merge_1", "output_shape_type": "raw"}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "class_name": "Dense", "name": "dense_1", "config": {"trainable": true, "b_constraint": null, "output_dim": 1000, "input_dim": null, "W_regularizer": null, "bias": true, "activation": "softmax", "name": "dense_1", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "W_constraint": null}}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_1", 0, 0]], "name": "model_1"}, "keras_version": "1.1.0"}